app/controllers/api/v1/educational_institutions_controller.rb

SELECT "educational_institutions".* FROM "educational_institutions" ORDER BY id DESC
---
    def index
        @institutions = EducationalInstitution.order("id DESC")

INSERT INTO "educational_institutions" ("name", "cnpj", "institution_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Unibta"], ["cnpj", "06.123.247/0001-81"], ["institution_type", "Universidade"], ["created_at", "2021-03-25 18:36:53.584744"], ["updated_at", "2021-03-25 18:36:53.584744"]]
---
    def create
        @institution = EducationalInstitution.new(institutions_params)
        if @institution.save