app/controllers/api/v1/enrollments_controller.rb

SELECT "enrollments".* FROM "enrollments" ORDER BY id DESC
---
    def index
        @enrollments = Enrollment.order("id DESC")