app/controllers/api/v1/payments_controller.rb

    def index
        @payments = Payment.order("id DESC")
---
SELECT "payments".* FROM "payments" ORDER BY id DESC