app/controllers/api/v1/students_controller.rb

    def index
        @students = Student.order("id DESC")
---
SELECT "students".* FROM "students" ORDER BY id DESC