app/models/enrollment.rb

INSERT INTO "payments" ("payment_value", "due_date", "enrollment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["payment_value", "100.0"], ["due_date", "2021-04-15"], ["enrollment_id", 2], ["created_at", "2021-04-06 15:10:33.203853"], ["updated_at", "2021-04-06 15:10:33.203853"]]
---
  def insert_payment
    #valor da fatura = valor total da matricula(curso) / quantidade de faturas
    payment_value = (self.value_total / self.installments)

    date = self.created_at
    if self.due_date <= date.day
      date = date.next_month
    end

    for i in 1..self.installments
      payday = self.due_date
      last_day = Date.new(date.year, date.month, -1).day
      if payday > last_day
        payday = last_day
      end
      payment = Payment.create(payment_value: payment_value,due_date: Date.new(date.year, date.month, payday), status: "Aberta", enrollment: self)